<?php
    // echo "<br><B>어린이(10세이하)의 입장료 50% 할인</B><br>";
    // echo "===============================================<br>";

    // $fee = 5000;
    // $age = 8;

    // if($age <= 10){
    //     $fee *= 0.5;
    //     echo "($age)세는 어린이므로 50%할인됨 <br> 요금 ($fee)원 입니다...<br><br>";
    // }
    // echo "===============================================<br>";
    
    // echo ">> 기본 입장료는 5,000원 입니다...<br>";




    ########################################################

    // echo "<br><B>⬛ 3과목의 총점과 평균과 등급 산출 프로그램 </B><br>";
    // echo "===============================================<br>";

    // $net = 88;
    // $sec = 79;
    // $Win = 95;
    // $sum =  $net + $sec + $Win;

    // $avg = $sum/3;

    // echo " > 네트워크 : ($net) 점<br>";
    // echo " > 네트워크 : ($sec) 점<br>";
    // echo " > 네트워크 : ($Win) 점<br>";


    // echo "------------------------------------------------<br>";









    #############################################################


    #40

    // echo "<br><B> 구구단 출력 프로그램 </B> <br>";
    // echo "===============================================<br>";


    // for($dan  = 2; $dan <= 9; $dan++){
    //     echo " < ($dan) 의단 <br>";
    //     echo "--------------------";


    //     for($count = 1; $count <= 9; $count++){
    //         $gob  = $dan * $count;
    //         echo "($dan) X ($count) = ($gob) <br>";

    //     }
    //     echo "--------------------<br>";
    // }


    // $a  =  $_POST['a'];
    // $b = strlen($a);

    // echo "<b>남긴 글 내용--- ::  {$b} byte <br><br>";
    // if(b <= 20){

    //     echo $a;
    // }else{
    //     $c =$b- 20;
    //     echo "x. Error : ($c) byte가 초과<br><br>";
    //     echo "o. 20byte 이내로 작성해야 합니다.";
    // }


     $a  =  $_POST['a'];
     $a = nl2br($a);
     echo "추천하는 글 <br><hr>";
     echo $a;
?>